       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXEMPLO-SUBTRACAO.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  NUM1 PIC 999 VALUE 100.
       01  NUM2 PIC 999 VALUE 50.
       01  RESULTADO PIC 999.

       PROCEDURE DIVISION.
        
           SUBTRACT 30 FROM NUM1.
           DISPLAY 'NUM1 - 30' NUM1.

           SUBTRACT NUM2 FROM NUM1 GIVING RESULTADO.
           DISPLAY 'NUM2 - NUM1: ' RESULTADO.

           STOP RUN.
