       IDENTIFICATION DIVISION.
       PROGRAM-ID. INITIALIZE-LIMPEZA-DE-DADOS.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  CLIENTE.
           05 NOME    PIC X(30) VALUE 'TESTE'.
           05 IDADE   PIC 99 VALUE 25.
           05 SALARIO PIC 9(5)V99 VALUE 5000.00.

       PROCEDURE DIVISION.
           
       *> LIMPEZA TUDO (numéricos = 0, alfanuméricos = spaces)
           INITIALIZE CLIENTE.

           INITIALIZE CLIENTE REPLACING NUMERIC DATA BY 99.
           INITIALIZE CLIENTE REPLACING ALPHANUMERIC DATA BY 'N/A'.

           STOP RUN.