      * Modelo de dados de cadastro de marcas
                  01  CADASTRO-MARCAS.
                                     05 ID-MARCA PIC 9(03).
                                     05 NOME-MARCA PIC X(30).
