       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMA-MULTIPLICACAO.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01  NUM1 PIC 999 VALUE 100.
       01  NUM2 PIC 999 VALUE 50.
       01  RESULTADO PIC 9999.

       PROCEDURE DIVISION.

           MULTIPLY 3 BY NUM1. *> MULTIPLICA NUM1 POR 3
           DISPLAY 'NUM1 APÓS MULTIPLICAÇÃO POR 3: ' NUM1.

           *> MULTIPLICA NUM1 POR NUM2 E ARMAZENA EM RESULTADO
           MULTIPLY NUM1 BY NUM2 GIVING RESULTADO. 
           DISPLAY 'RESULTADO ENTRE A MULT N1 * N2: ' RESULTADO.
        
           STOP RUN.