       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXEMPLO-DE-ADICAO.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       77 NUM1 PIC 999 VALUE 100.
       77 NUM2 PIC 999 VALUE 250.
       77 RESULTADO PIC 999.

       PROCEDURE DIVISION.

           ADD 10 TO NUM1.

           DISPLAY 'NUM1: ' NUM1.

           ADD NUM1 NUM2 GIVING RESULTADO.
           DISPLAY 'RESULTADO ENTRE A ADD N1 + N2:' RESULTADO.
           
           *> ADIÇÃO COM MAIS DE DOIS PARÂMETROS
           *> GIVING NO COBOL É UTILIZADO PARA ARMAZENAR O RESULTADO
           ADD 10 20 50 GIVING RESULTADO.
           DISPLAY 'RESULTADO ENTRE A ADD 10 + 20 + 50:' RESULTADO.

           STOP RUN.