000000 IDENTIFICATION DIVISION.
000001     PROGRAM-ID. HelloWorld.
000002 PROCEDURE DIVISION.
000003         DISPLAY "Hello, World!".
000004     STOP RUN.
