000000*   IDENTIFICA O PROGRAMA, NOME AUTOR E DATA
000001    IDENTIFICATION DIVISION.
000002    PROGRAM-ID. FIST-PROGRAM.
000003    AUTHOR. RODRIGO.
000004    
000005*   CONFIGURAÇÕES DE HARDWARE / ARQUIVOS
000006    ENVIRONMENT DIVISION.
000007
000008*   DECLARAÇÃO DE VARIÁVEIS E ESTRUTURAS
000009    DATA DIVISION.
000010    
000011*   WORKING SÃO ÁREA DE TRABALHO TEMPORÁRIA
000012    WORKING-STORAGE SECTION.
000013    01 NOME PIC X(7) VALUE 'RODRIGO'.
000014
000015*   PROCEDURE DIVISION - LÓGICA DO PROGRAMA
000016    PROCEDURE DIVISION.
000017     DISPLAY 'OLÁ, ' NOME.
000018     STOP RUN.
