       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXEMPLO-DIVISAO.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 DIVIDENDO PIC 999 VALUE 100.
       01 DIVISOR PIC 99 VALUE 5.
       01 QUOCIENTE PIC 999.
       01 RESTO PIC 99.

       PROCEDURE DIVISION.

           DIVIDE DIVISOR INTO DIVIDENDO.
           DISPLAY 'DIVIDINDO 100 POR 5: ' DIVIDENDO.

           DIVIDE DIVIDENDO BY DIVISOR GIVING QUOCIENTE.
           DISPLAY 'VALOR DO RESULTADO DA OPERACAO' QUOCIENTE.

           *> COM O RESTO
           DIVIDE 100 BY 3
               GIVING QUOCIENTE
               REMAINDER RESTO.
      
           DISPLAY 'QUOCIENTE É IGUAL A ' QUOCIENTE.
      
           DISPLAY 'RESTO É IGUAL A ' RESTO.
      
           STOP RUN.
           